{

    "softwareVersion": "v2",

    "mode": "kiosk",

    "credentials": {
        "db": {
            "url": "mongodb+srv://Cluster70600:W3FEU0d0aXZe@cluster70600.stuctmh.mongodb.net/db?retryWrites=true&w=majority&appName=Cluster70600"
        }
    },

    "congressTitle": "118th Congress",

    "defaultConfig": {
        "numLegislativeBodies": 2,
        "numParties": 2,

        "chamber1": {
                "totalMembers": 432,
                "partyA": 220,
                "partyB": 212,
                "partyC": 0
        },

        "chamber2": {
                "totalMembers": 100,
                "partyA": 49,
                "partyB": 51,
                "partyC": 0
        },

        "chamber3": {
                "totalMembers": 0,
                "partyA": 0,
                "partyB": 0,
                "partyC": 0
        },

        "vicePres": {
            "totalMembers": 1,
            "partyA": 0,
            "partyB": 1,
            "partyC": 0
        },

        "president": {
            "totalMembers": 1,
            "partyA": 0,
            "partyB": 1,
            "partyC": 0
        },

        "percentMajority": 50,
        "percentSupermajority": 67,

        "probabilityYesVote": {
            "partyA": 70,
            "partyB": 30,
            "partyC": 50
        }
    },


    "historicalActs": [
        {
            "title": "Civil Rights Act",
            "date": "06-19-1964",
            "supportedParty": "Democratic",
            "description": "Virtually every scholar, liberal and conservative, ranked this act first on their list. Its impact is unquestionable: Coming after a decade of civil rights struggle in the South and on the heels of President John F. Kennedy's assassination, the hotly contested act effectively ended racial discrimination in public accommodations and employment. Less noticed initially, but arguably just as significant, is the act's role in ending discrimination based on sex. \"America could scarcely lay claim to be a moral exemplar for the world prior to this act,\" Lichtman said."
        },

        {
            "title": "Voting Rights Act",
            "date": "08-106-1965",
            "supportedParty": "Democratic",
            "description": "A few of our scholars ranked this act equal to, or even higher than, the Civil Rights Act. They cited not only its intended impact on ensuring the vote for blacks, but also its unintended but profound role in realigning American politics. After the VRA, white voters, first in the South and then elsewhere, flocked to the Republican Party. This in turn made possible America’s turn to the right on economic, social and foreign policy since the 1980s."
        },

        {
            "title": "Medicare and Medicaid Act",
            "date": "07-30-1965",
            "supportedParty": "Democratic",
            "description": "Together, these programs have protected the health of countless elderly and poor Americans, putting it “right up there with Social Security in its impact on American life,” in Aberbach’s words. And looking into the future, the programs are so enormous that both the federal government and state governments are destined to face intractable budget challenges."
        },

        {
            "title": "Federal-Aid Highway Act",
            "date": "06-29-1956",
            "supportedParty": "Republican",
            "description": "Its title is obscure, but its impact is not: The act created the Interstate Highway System, which touched virtually every aspect of American life in the past 50 years. Faster roads intensified economic growth, boosted domestic tourism and made possible just-in-time manufacturing processes. Interstates also produced suburbanization, which dramatically changed lifestyles (more space, but longer commutes), drove downtowns into decline and led to the development of previously empty land. Population shifted to the Sun Belt, changing the nation’s political balance. And the Interstates irreversibly solidified the primacy of the automobile, worsening air pollution and climate change and cementing the strategic importance of the Middle East."
        },

        {
            "title": "Clean Air Act",
            "date": "12-31-1970",
            "supportedParty": "Democratic",
            "description": "Other landmarks of environmental legislation could easily have filled this spot — such as the National Environmental Policy Act, passed the previous year — but this measure attracted the most support among our panelists. It played a key role in the federal government’s pre-emption of state regulatory authority over the environment, and, coming shortly after the first Earth Day, it was designed to be a clear signal that environmental regulation and economic growth were not incompatible. Despite some ups and downs, that view still holds considerable sway."
        },

        {
            "title": "National Defense Education Act",
            "date": "09-02-1958",
            "supportedParty": "Democratic",
            "description": "Passed in response to the Soviet launch of the satellite Sputnik, NDEA provided $575 million for education and low-interest loans for students. Its stated focus on boosting achievement in science and mathematics helped enhance the nation’s intellectual capital, laying the groundwork for decades of American innovation in science and technology and, in turn, providing a basis for economic growth, military superiority and world leadership. The act is relatively forgotten today; only two of our panelists cited it."
        },

        {
            "title": "Personal Responsibility and Work Opportunity Reconciliation Act",
            "date": "08-22-1996",
            "supportedParty": "Republican",
            "description": "This major overhaul of welfare, requiring work rather than government assistance, directly affected many Americans. But it was also passed by a Republican Congress and signed by a Democratic president, Bill Clinton, thus signaling the bipartisan abandonment — albeit a long time coming — of the ideas that undergirded President Lyndon Johnson’s Great Society."
        },

        {
            "title": "Tonkin Gulf Resolution",
            "date": "08-07-1964",
            "supportedParty": "Democratic",
            "description": "The Tonkin Gulf Resolution authorized military action in Vietnam, leading the United States into a conflict that left more than 50,000 Americans dead and bequeathed tremendous divisiveness at home. Beyond that, however, the resolution — which was based on an attack that may not have taken place at all — was a major landmark for presidential authority on waging war. Ever since, presidents have exercised largely unfettered power to commit American troops abroad, with little say by Congress, despite passage of the War Powers Resolution of 1973."
        },

        {
            "title": "Immigration and Nationality Act",
            "date": "10-03-1965",
            "supportedParty": "Democratic",
            "description": "This legislation, sponsored by Sen. Phil Hart (D-Mich.) and Rep. Emanuel Celler (D-N.Y.), is the sleeper of the list. It removed national-origins quotas for immigrants that had stood since 1921, thus clearing the way for a new wave of mass immigration that transformed America. To supporters, these immigrants have strengthened America’s economy; to detractors, they have been a burden, especially for native-born Americans who face new competition for jobs. Either way, the influx of immigrants from around the globe has irrevocably redefined American culture. “At the time, it wasn’t thought to be all that important, and it wasn’t very controversial,” Mayhew said. “But few acts of Congress have ever been as consequential.”"
        },

        {
            "title": "Economic Recovery Tax Act",
            "date": "08-13-1981",
            "supportedParty": "Republican",
            "description": "ERTA, the keystone of President Ronald Reagan's economic program, cut individual taxes by 25 percent, indexed tax rates to end “bracket creep” and made other technical changes that have had an enormous influence on the economy in the past quarter-century. In a larger sense, ERTA ushered in an era in which big government, and sometimes any government, ceased to be seen as an unalloyed good. The act “changed the direction of the federal government — the biggest shift since the New Deal — and laid the foundation for Republican success,” Uslaner said."
        }
        
    ],

    "mediaAssetPaths": {
        "bkgImg1": "url('../assets/gridandfloorplan-dark.svg')",
        "bkgImg2": "url('../assets/2gearslight-dark.svg')",
        "numberLineIcon": "url('../assets/numberline-dark.svg')",
        "simulatorIcon": "url('../assets/simulator-icon-dark.svg')",
        "mediaIcon": "url('../assets/media-icon-dark.svg')",
        "aboutIcon": "url('../assets/about-icon-dark.svg')",
        "codeIcon": "url('../assets/code-icon-dark.svg')"
    }, 

    "cssParams": {
        "background": "#d5eddc",
        "headerFooterBkg": "#76b7e8",
        "text": "#000000",
        "button": "#d9cb50",
        "activeNav": "#c42727",
        "link": "#f03e3e",
        "linkHover": "#c47cb7",
        "textOverlay": "#ffffff",
        "rectColor": "#64b804",
        "rectColor2": "#1e7d21",
        "rectColor3": "#12cc7f",
        "majorityBar": "#7a59bd",
        "supermajorityBar": "#511bbf",
        "paneBkg": "#e3e3e3",
        "paneBorder": "#757575",
        "sliderStart": "62vh",
        "sliderOffset": "7vh"
    },

    "text": {
        "shortDescription": "<p>The Future Democracies Laboratory is a transdisciplinary research center dedicated to the investigation of methodologies and technologies for collective decision-making. The laboratory hosts a platform for rapidly modeling and testing democratic systems.</p><p>This desk will give you control over parameters ranging from the number of legislative chambers to the percentage vote required for the legislature to override a presidential veto. After changing these parameters from the default (i.e., the current configuration of the United States federal government), you will be able to run simulated roll calls and see how the government would vote on legislation such as the Civil Rights Act, the Immigration and Nationality Act, and the Clean Air Act.</p><p>The Future Democracies Laboratory also hosts a repository of alternatives to the current government. After you have reconfigured the system, you will have the option of contributing your model to the laboratory's database for further testing and adjustment by other people.</p>",
        "detailedDescription": "<h2>More About This Project</h2><p>The Future Democracies Laboratory is a transdisciplinary research center dedicated to the investigation of methodologies and technologies for collective decision-making. Directed by experimental philosopher Jonathon Keats, the laboratory is run in collaboration with San Jos&eacute; State University under the direction of Professor Steve Durie</p><p>The laboratory hosts an open-source platform for rapidly modeling and testing democratic systems. The research platform is based on the Federal government of the United States, emulating the decision-making logic by which and legislation is processed. Parameters are adjustable, as is the governing structure. The system is also capable of testing alternative models with actual and hypothetical legislation. For the testing phase, elected officials are simulated with random number generators, where the probabilities of voting outcomes can be set according to the political status quo or anticipated demographics. Data collected through the legislative emulator and source code are freely available on request.</p><p>In addition to the legislative emulator, the Future Democracies Laboratory maintains a versatile experimental suite for researching and developing alternative voting metrics, as well as philosophical instruments to investigate the nature of governance. Experimental polling modules allow researchers to study decision-making inputs ranging from social media activity to physiological phenomena. Additional units monitor hormonal stress of other species, including animals and plants, allowing researchers to study ways in which nature might be enfranchised.</p><p>The Future Democracy Laboratory&rsquo;s research program is augmented by public outreach. Alternative decision-making models provide a basis for discussion and debate, as does the operating system itself. (Do weighted random number generators better represent the public interest than flesh-and-blood politicians? Might the emulator become the government?) Through a unique combination of speculation and provocation, researchers and the public at large are actively engaged in the democratic process of deciding the future of democracy.</p>",
        "newSessionDesc": "<p>This session will present a simplified version of the current configuration of the federal government, showing the political makeup of the legislative and executive branches as of September 2024. Using the control panel sliders, you can modify nine different parameters. You can move backward and forward between parameters using the joystick. When you have come up with a system you would like to test, you will be able to access the legislative emulator.</p>",
        "selectSessionDesc": "<p>Governmental configurations developed by previous participants can be accessed on this page. You can select a session below to review and modify. You can add your modifications to the database for further modification by others. The database is cumulative. Past configurations will not be overwritten.</p>",
        "p02desc": "<p>There are currently 435 members of the House of Representatives, 100 senators, 1 vice president and one president. Use this slider to increase or decrease the number.</p>",
        "p03desc": "<p>There are currently two major political parties, the Democrats and the Republicans. Use this slider to increase or decrease the number of parties. You will be able to set the probability with which each party will support change to the political system on a future panel.</p>",
        "p04desc": "<p>Use this slider to change the proportion of members of representing each party in the first legislative chamber.</p>",
        "p05desc": "<p>Use this slider to change the proportion of members of representing each party in the second legislative chamber.</p>",
        "p06desc": "<p>Use this slider to change the proportion of members of representing each party in the third legislative chamber.</p>",
        "p07desc": "<p>If you have increased the number of vice presidents to more than one, use this slider to chance the proportion of members of representing each party in the vice presidency. The vice president(s) will only vote in case of a tie in a legislative chamber.</p>",
        "p08desc": "<p>If you have increased the number of presidents to more than one, use this slider to chance the proportion of members of representing each party in the presidency. The president(s) can vote to veto legislation.</p>",
        "p09desc": "<p>Currently a simple majority is required for a legislative chamber to approve a bill. Use this slider to increase or decrease the number the threshold for each chamber.</p>",
        "p10desc": "<p>The emulator uses a random number generator to simulate the response of each politician to any given bill. Use these sliders to set the probability that a member of a given party will elect to change the status quo by voting in favor of a bill.</p>",
        "p11desc1": "<br><br><p>The emulator provides an approximation of how the government might behave given the parameters you have selected. Press the 'Test Vote' button to observe your configuration in action and to see sample results of a vote on an unspecified bill.</p>",
        "p11desc2": "<br><br><p>If the system is behaving as anticipated, press the 'Next' button. If you want to adjust parameters, press 'Back'.</p>",
        "p12desc": "<br><br><p>Use this benchmark test to assess the performance of your governmental configuration in real-world conditions. The emulator will run ten times, voting on ten historically important bills that significantly changed the political status quo. The benchmark test will show how the bills might have fared given the system you have modeled. </p>",
        "benchResultsDesc": "<p style='font-weight:bold;'>Review the following benchmark results to assess whether your governmental system meets your standards. If so, approve the model on the next page and save it for others to assess and modify.</p>"
    }
    
}