{

    "softwareVersion": "v2",

    "mode": "kiosk",

    "credentials": {
        "db": {
            "url": "mongodb+srv://Cluster70600:W3FEU0d0aXZe@cluster70600.stuctmh.mongodb.net/db?retryWrites=true&w=majority&appName=Cluster70600"
        }
    },

    "congressTitle": "118th Congress",

    "defaultConfig": {
        "numLegislativeBodies": 2,
        "numParties": 2,

        "chamber1": {
                "totalMembers": 435,
                "partyA": 222,
                "partyB": 213,
                "partyC": 0
        },

        "chamber2": {
                "totalMembers": 100,
                "partyA": 49,
                "partyB": 51,
                "partyC": 0
        },

        "chamber3": {
                "totalMembers": 0,
                "partyA": 0,
                "partyB": 0,
                "partyC": 0
        },

        "vicePres": {
            "totalMembers": 1,
            "partyA": 0,
            "partyB": 1,
            "partyC": 0
        },

        "president": {
            "totalMembers": 1,
            "partyA": 0,
            "partyB": 1,
            "partyC": 0
        },

        "percentMajority": 50,
        "percentSupermajority": 67,

        "probabilityYesVote": {
            "partyA": 70,
            "partyB": 30,
            "partyC": 50
        }
    },


    "historicalActs": [
        {
            "title": "Global Food Security Act",
            "date": "2016",
            "supportedParty": "",
            "description": "Authorizes foreign assistance to developing countries to reduce global poverty and hunger, and achieve food security and improved nutrition."
        },
        
        {
            "title": "Government Employee Fair Treatment Act",
            "date": "2019",
            "supportedParty": "",
            "description": "Requires retroactive pay and leave accrual for federal employees affected by lapses in appropriations."
        },

        {
            "title": "Respect for Marriage Act",
            "date": "2022",
            "supportedParty": "",
            "description": "Requires the federal government and all states and territories to recognize the validity of same-sex and interracial civil marriages in the United States."
        },

        {
            "title": "Countering America's Adversaries Through Sanctions Act",
            "date": "2017",
            "supportedParty": "",
            "description": "Imposes sanctions on Iran, North Korea, and Russia"
        },

        {
            "title": "Emmett Till Antilynching Act",
            "date": "2022",
            "supportedParty": "",
            "description": "Defines lynching as a federal hate crime and increases the maximum penalty to 30 years imprisonment for hate crime offenses."
        },
        
        {
            "title": "Formerly Incarcerated Reenter Society Transformed Safely Transitioning Every Person Act",
            "date": "2018",
            "supportedParty": "",
            "description": "Reduces prison populations and prison sentence lengths for non-violent offenders and promotes programs assisting return to society."
        },
        
        {
            "title": "USA Freedom Act",
            "date": "2015",
            "supportedParty": "",
            "description": "Renews the 2001 Patriot Act, restores authorization for roving wiretaps, and bans bulk collection of data of Americans' telephone records and internet metadata."
        },
        
        {
            "title": "Infrastructure Investment and Jobs Act",
            "date": "2021",
            "supportedParty": "",
            "description": "Supports federal highway and rail programs and provides funding for broadband access, clean water and electric grid renewal."
        },
        
        {
            "title": "Conservation, Management, and Recreation Act",
            "date": "2019",
            "supportedParty": "",
            "description": "Designates new wilderness areas, expands national parks, protects rivers, and withdraws land from mining."
        },
        
        {
            "title": "Inflation Reduction Act",
            "date": "2022",
            "supportedParty": "",
            "description": "reduces the federal government budget deficit, lowers prescription drug prices, invests in domestic energy production, and promotes clean energy."
        },
        
        {
            "title": "Sexual Assault Survivors' Rights Act",
            "date": "2016",
            "supportedParty": "",
            "description": "Establishes statutory rights in federal code for survivors of sexual assault and rape."
        },

        {
            "title": "Music Modernization Act",
            "date": "2018",
            "supportedParty": "",
            "description": "Facilitates legal licensing of music by digital services and provides protections to pre-1972 sound recordings."
        }

    ],

    "mediaAssetPaths": {
        "bkgImg1": "url('../assets/gridandfloorplan-light.svg')",
        "bkgImg2": "url('../assets/2gearslight.svg')",
        "numberLineIcon": "url('../assets/numberline.svg')",
        "simulatorIcon": "url('../assets/simulator-icon.svg')",
        "mediaIcon": "url('../assets/media-icon.svg')",
        "aboutIcon": "url('../assets/about-icon.svg')",
        "codeIcon": "url('../assets/code-icon.svg')"
    }, 

    "cssParams": {
        "background": "#1c2f47",
        "headerFooterBkg": "#2b4361",
        "text": "#f5f5f5",
        "button": "#8c80a8",
        "sliderHandle": "#998f77",
        "activeNav": "#bfaf8a",
        "link": "#bfaf8a",
        "linkHover": "#c47cb7",
        "textOverlay": "#1c2f47",
        "rectColor": "#bfaf8a",
        "rectColor2": "#a4d7e0",
        "rectColor3": "#8abd8b",
        "majorityBar": "#bf8a98",
        "supermajorityBar": "#c4b2ed",
        "paneBkg": "#2b4361",
        "paneBorder": "#757575",
        "sliderStart": "60px",
        "sliderOffset": "7vh",
        "progressVal": "#cccccc",
        "progressRemainder": "#757575"
    },

    "text": {
        "title": "<h1>Automated Future Democracies Simulator</h1>",
        "shortDescription": "<p>The Future Democracies Laboratory is a transdisciplinary research center dedicated to the investigation of methodologies and technologies for collective decision-making. The laboratory hosts a platform for rapidly modeling and testing democratic systems.</p><p>This desk will give you control over parameters ranging from the number of legislative chambers to the percentage vote required for the legislature to override a presidential veto. After changing these parameters from the default (i.e., the current configuration of the United States federal government), you will be able to run simulated roll calls and see how the government would vote on legislation such as the Civil Rights Act, the Immigration and Nationality Act, and the Clean Air Act.</p><p>The Future Democracies Laboratory also hosts a repository of alternatives to the current government. After you have reconfigured the system, you will have the option of contributing your model to the laboratory's database for further testing and adjustment by other people.</p>",
        "detailedDescription": "<p>The Future Democracies Laboratory is a transdisciplinary research center dedicated to the investigation of methodologies and technologies for collective decision-making. Directed by experimental philosopher Jonathon Keats, the laboratory is run in collaboration with San Jos&eacute; State University under the direction of Professor Steve Durie</p><p>The laboratory hosts an open-source platform for rapidly modeling and testing democratic systems. The research platform is based on the Federal government of the United States, emulating the decision-making logic by which and legislation is processed. Parameters are adjustable, as is the governing structure. The system is also capable of testing alternative models with actual and hypothetical legislation. For the testing phase, elected officials are simulated with random number generators, where the probabilities of voting outcomes can be set according to the political status quo or anticipated demographics. Data collected through the legislative emulator and source code are freely available on request.</p><p>In addition to the legislative emulator, the Future Democracies Laboratory maintains a versatile experimental suite for researching and developing alternative voting metrics, as well as philosophical instruments to investigate the nature of governance. Experimental polling modules allow researchers to study decision-making inputs ranging from social media activity to physiological phenomena. Additional units monitor hormonal stress of other species, including animals and plants, allowing researchers to study ways in which nature might be enfranchised.</p><p>The Future Democracy Laboratory&rsquo;s research program is augmented by public outreach. Alternative decision-making models provide a basis for discussion and debate, as does the operating system itself. (Do weighted random number generators better represent the public interest than flesh-and-blood politicians? Might the emulator become the government?) Through a unique combination of speculation and provocation, researchers and the public at large are actively engaged in the democratic process of deciding the future of democracy.</p>",
        "newSessionDesc": "<p>This session will present a simplified version of the current configuration of the federal government, showing the political makeup of the legislative and executive branches as of September 2024. Using the control panel sliders, you can modify nine different parameters. You can move backward and forward between parameters using the joystick. When you have come up with a system you would like to test, you will be able to access the legislative emulator.</p>",
        "selectSessionDesc": "<p>Governmental configurations developed by previous participants can be accessed on this page. You can select a session below to review and modify. You can add your modifications to the database for further modification by others. The database is cumulative. Past configurations will not be overwritten.</p>",
        "p01desc": "<p>There are currently two legislative bodies, the House of Representatives and the Senate. Use this slider to increase or decrease the number.</p>",
        "p02desc": "<p>There are currently 435 members of the House of Representatives, 100 senators, 1 vice president and one president. Use this slider to increase or decrease the number.</p>",
        "p03desc": "<p>There are currently two major political parties, the Democrats and the Republicans. Use this slider to increase or decrease the number of parties. You will be able to set the probability with which each party will support change to the political system on a future panel.</p>",
        "p04desc": "<p>Use this slider to change the proportion of members of representing each party in the first legislative chamber.</p>",
        "p05desc": "<p>Use this slider to change the proportion of members of representing each party in the second legislative chamber.</p>",
        "p06desc": "<p>Use this slider to change the proportion of members of representing each party in the third legislative chamber.</p>",
        "p07desc": "<p>If you have increased the number of vice presidents to more than one, use this slider to chance the proportion of members of representing each party in the vice presidency. The vice president(s) will only vote in case of a tie in a legislative chamber.</p>",
        "p08desc": "<p>If you have increased the number of presidents to more than one, use this slider to chance the proportion of members of representing each party in the presidency. The president(s) can vote to veto legislation.</p>",
        "p09desc": "<p>Currently a simple majority is required for a legislative chamber to approve a bill. Use this slider to increase or decrease the number the threshold for each chamber.</p>",
        "p10desc": "<p>The emulator uses a random number generator to simulate the response of each politician to any given bill. Use these sliders to set the probability that a member of a given party will elect to change the status quo by voting in favor of a bill.</p>",
        "p11desc1": "<p>The emulator provides an approximation of how the government might behave given the parameters you have selected. Press the 'Test Vote' button to observe your configuration in action and to see sample results of a vote on an unspecified bill.</p>",
        "p11desc2": "<p>If the system is behaving as anticipated, press the 'Next' button. If you want to adjust parameters, press 'Back'.</p>",
        "p12desc": "<p>Use this benchmark test to assess the performance of your governmental configuration in real-world conditions. The emulator will run ten times, voting on ten historically important bills that significantly changed the political status quo. The benchmark test will show how the bills might have fared given the system you have modeled. </p>",
        "benchResultsDesc": "<p>Review the following benchmark results to assess whether your governmental system meets your standards. If so, approve the model on the next page and save it for others to assess and modify.</p>",
        "evalDesc": "<h2>This is the form of government you designed.<br>Do you endorse this?</h2>",
        "saveDesc": "<p style='text-align:center'>Please record your session ID.<br>You can add your modifications to the database for further modification by others.</p>",
        "saveCompleteDesc": "<p style='text-align:center'>Please record your session ID to retrieve it later.</p>"
    }
    
}